---
kind: method
id: M:Autodesk.Revit.DB.AlphanumericRevisionSettings.IsValid
source: html/6c14b024-3da1-2446-aafc-796d958a4ded.htm
---
# Autodesk.Revit.DB.AlphanumericRevisionSettings.IsValid Method

Determines whether the AlphanumericRevisionSettings object is in a valid state.

## Syntax (C#)
```csharp
public bool IsValid()
```

## Returns
True if the settings are valid.

## Remarks
The AlphanumericRevisionSettings should have at least one string in its revision numbering sequence.